Oryx-Embedded/CycloneTCP/drivers/stm32f7xx_eth.c
   //Start a read operation
   ETH->MACMIIAR = temp;
   //Wait for the read to complete
   while(ETH->MACMIIAR & ETH_MACMIIAR_MB);

   //Read register value
   data = ETH->MACMIIDR & ETH_MACMIIDR_MD;
#endif

   //Return PHY register contents
   return data;
}


/**
 * @brief SMI write operation
 * @param[in] data Raw data to be written
 * @param[in] length Number of bits to be written
 **/

void stm32f7xxEthWriteSmi(uint32_t data, uint_t length)
{
#if defined(STM32F7XX_ETH_MDC_PIN) && defined(STM32F7XX_ETH_MDIO_PIN)
   GPIO_InitTypeDef GPIO_InitStructure;

   //Skip the most significant bits since they are meaningless
   data <<= 32 - length;

   //Configure MDIO as an output
   GPIO_InitStructure.Pin = STM32F7XX_ETH_MDIO_PIN;
   GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
   GPIO_InitStructure.Pull = GPIO_NOPULL;
   GPIO_InitStructure.Speed = GPIO_SPEED_MEDIUM;
   HAL_GPIO_Init(STM32F7XX_ETH_MDIO_GPIO, &GPIO_InitStructure);

   //Write the specified number of bits
   while(length--)
   {
      //Write MDIO
      if(data & 0x80000000)
      {
         HAL_GPIO_WritePin(STM32F7XX_ETH_MDIO_GPIO,
            STM32F7XX_ETH_MDIO_PIN, GPIO_PIN_SET);
      }
      else
      {
         HAL_GPIO_WritePin(STM32F7XX_ETH_MDIO_GPIO,
            STM32F7XX_ETH_MDIO_PIN, GPIO_PIN_RESET);
      }

      //Delay
      usleep(1);

      //Assert MDC
      HAL_GPIO_WritePin(STM32F7XX_ETH_MDC_GPIO,
         STM32F7XX_ETH_MDC_PIN, GPIO_PIN_SET);

      //Delay
      usleep(1);

      //Deassert MDC
      HAL_GPIO_WritePin(STM32F7XX_ETH_MDC_GPIO,
         STM32F7XX_ETH_MDC_PIN, GPIO_PIN_RESET);

      //Rotate data
      data <<= 1;
   }
#endif
}


/**
 * @brief SMI read operation
 * @param[in] length Number of bits to be read
 * @return Data resulting from the MDIO read operation
 **/

uint32_t stm32f7xxEthReadSmi(uint_t length)
{
   uint32_t data = 0;

#if defined(STM32F7XX_ETH_MDC_PIN) && defined(STM32F7XX_ETH_MDIO_PIN)
   GPIO_InitTypeDef GPIO_InitStructure;

   //Configure MDIO as an input
   GPIO_InitStructure.Pin = STM32F7XX_ETH_MDIO_PIN;
   GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
   GPIO_InitStructure.Pull = GPIO_PULLUP;
   GPIO_InitStructure.Speed = GPIO_SPEED_MEDIUM;
   HAL_GPIO_Init(STM32F7XX_ETH_MDIO_GPIO, &GPIO_InitStructure);

   //Read the specified number of bits
   while(length--)
   {
      //Rotate data
      data <<= 1;

      //Assert MDC
      HAL_GPIO_WritePin(STM32F7XX_ETH_MDC_GPIO,
         STM32F7XX_ETH_MDC_PIN, GPIO_PIN_SET);

      //Delay
      usleep(1);

      //Deassert MDC
      HAL_GPIO_WritePin(STM32F7XX_ETH_MDC_GPIO,
         STM32F7XX_ETH_MDC_PIN, GPIO_PIN_RESET);

      //Delay
      usleep(1);

      //Check MDIO state
      if(HAL_GPIO_ReadPin(STM32F7XX_ETH_MDIO_GPIO, STM32F7XX_ETH_MDIO_PIN))
         data |= 0x00000001;
   }
#endif

   //Return the received data
   return data;
}


/**
 * @brief CRC calculation
 * @param[in] data Pointer to the data over which to calculate the CRC
 * @param[in] length Number of bytes to process
 * @return Resulting CRC value
 **/

uint32_t stm32f7xxEthCalcCrc(const void *data, size_t length)
{
   uint_t i;
   uint_t j;

   //Point to the data over which to calculate the CRC
   const uint8_t *p = (uint8_t *) data;
   //CRC preset value
   uint32_t crc = 0xFFFFFFFF;

   //Loop through data
   for(i = 0; i < length; i++)
   {
      //The message is processed bit by bit
      for(j = 0; j < 8; j++)
      {
         //Update CRC value
         if(((crc >> 31) ^ (p[i] >> j)) & 0x01)
            crc = (crc << 1) ^ 0x04C11DB7;
         else
            crc = crc << 1;
      }
   }

   //Return CRC value
   return ~crc;
}
